In [13]:
import pandas as pd
df = pd.read_csv("E:\Programming\AI\ML\Codebasics Pandas\weather_report.csv")
df.head()

                  Date  Temperature   Humidity Conditions
0  2024-06-01 00:00:00    22.777346  77.935859     Cloudy
1  2024-06-02 00:00:00    22.582451  78.239990     Stormy
2  2024-06-03 00:00:00    26.680784  59.080233     Cloudy
3  2024-06-04 00:00:00    20.849121  61.596046     Stormy
4  2024-06-05 00:00:00    22.442286  52.210732      Sunny

In [6]:
employees = [
    ['Name', 'Age', 'Department', 'Salary'],
    ['Shah Sayem', 24, 'IT', 50000],
    ['Alal', 34, 'Sales', 60000],
    ['Shafkath', 45, 'HR', 65000],
    ['Ohi', 40, 'IT', 70000],
]

df2 = pd.DataFrame(employees)
df2

            0    1           2       3
0        Name  Age  Department  Salary
1  Shah Sayem   24          IT   50000
2        Alal   34       Sales   60000
3    Shafkath   45          HR   65000
4         Ohi   40          IT   70000

In [7]:
weather = {
    "Day": ["2024-06-01", "2024-06-02", "2024-06-03", "2024-06-04", "2024-06-05"],
    "Temperature": [22.77734553, 22.58245095, 26.68078354, 20.84912108, 22.44228565],
    "Humidity": [77.93585873, 78.23998996, 59.08023285, 61.59604643, 52.21073244],
    "Conditions": ["Cloudy", "Stormy", "Cloudy", "Stormy", "Sunny"]
}

df3 = pd.DataFrame(weather)
df3

          Day  Temperature   Humidity Conditions
0  2024-06-01    22.777346  77.935859     Cloudy
1  2024-06-02    22.582451  78.239990     Stormy
2  2024-06-03    26.680784  59.080233     Cloudy
3  2024-06-04    20.849121  61.596046     Stormy
4  2024-06-05    22.442286  52.210732      Sunny

In [17]:
row, col = df3.shape
row, col

(5, 4)

In [15]:
df3.head(3)

          Day  Temperature   Humidity Conditions
0  2024-06-01    22.777346  77.935859     Cloudy
1  2024-06-02    22.582451  78.239990     Stormy
2  2024-06-03    26.680784  59.080233     Cloudy

In [18]:
df3.tail(2)

          Day  Temperature   Humidity Conditions
3  2024-06-04    20.849121  61.596046     Stormy
4  2024-06-05    22.442286  52.210732      Sunny

In [19]:
df3[2:5]

          Day  Temperature   Humidity Conditions
2  2024-06-03    26.680784  59.080233     Cloudy
3  2024-06-04    20.849121  61.596046     Stormy
4  2024-06-05    22.442286  52.210732      Sunny

In [20]:
df3.columns

Index(['Day', 'Temperature', 'Humidity', 'Conditions'], dtype='object')

In [21]:
df3.Day

0    2024-06-01
1    2024-06-02
2    2024-06-03
3    2024-06-04
4    2024-06-05
Name: Day, dtype: object

In [22]:
df3["Conditions"]

0    Cloudy
1    Stormy
2    Cloudy
3    Stormy
4     Sunny
Name: Conditions, dtype: object

In [25]:
type(df3["Humidity"])

pandas.core.series.Series

In [26]:
df3[["Day", "Conditions"]]

          Day Conditions
0  2024-06-01     Cloudy
1  2024-06-02     Stormy
2  2024-06-03     Cloudy
3  2024-06-04     Stormy
4  2024-06-05      Sunny

In [27]:
df3["Temperature"].max()

26.68078354

In [29]:
df3["Temperature"].min()

20.84912108

In [30]:
df3["Temperature"].mean()

23.06639735

In [31]:
df3["Temperature"].std()

2.1614446601036885

In [32]:
df3.describe()

       Temperature   Humidity
count     5.000000   5.000000
mean     23.066397  65.812572
std       2.161445  11.721010
min      20.849121  52.210732
25%      22.442286  59.080233
50%      22.582451  61.596046
75%      22.777346  77.935859
max      26.680784  78.239990

In [33]:
df3[df3.Humidity >= 60]

          Day  Temperature   Humidity Conditions
0  2024-06-01    22.777346  77.935859     Cloudy
1  2024-06-02    22.582451  78.239990     Stormy
3  2024-06-04    20.849121  61.596046     Stormy

In [40]:
df3[df3.Temperature == df3.Temperature.max()]

          Day  Temperature   Humidity Conditions
2  2024-06-03    26.680784  59.080233     Cloudy

In [41]:
df3[df3.Humidity == df3["Humidity"].max()][["Day", "Humidity"]]

          Day  Humidity
1  2024-06-02  78.23999

In [42]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [43]:
df3.set_index("Day")

            Temperature   Humidity Conditions
Day
2024-06-01    22.777346  77.935859     Cloudy
2024-06-02    22.582451  78.239990     Stormy
2024-06-03    26.680784  59.080233     Cloudy
2024-06-04    20.849121  61.596046     Stormy
2024-06-05    22.442286  52.210732      Sunny

In [54]:
weather = {
    "Day": ["2024-06-01", "2024-06-02", "2024-06-03", "2024-06-04", "2024-06-06"],
    "Temperature": [22.77734553, 22.58245095, 26.68078354, 20.84912108, 22.44228565],
    "Humidity": [77.93585873, 78.23998996, 59.08023285, 61.59604643, 52.21073244],
    "Conditions": ["Cloudy", "Stormy", "Cloudy", "Stormy", "Sunny"]
}

df3 = pd.DataFrame(weather)
df3

          Day  Temperature   Humidity Conditions
0  2024-06-01    22.777346  77.935859     Cloudy
1  2024-06-02    22.582451  78.239990     Stormy
2  2024-06-03    26.680784  59.080233     Cloudy
3  2024-06-04    20.849121  61.596046     Stormy
4  2024-06-06    22.442286  52.210732      Sunny

In [56]:
df3.columns

Index(['Day', 'Temperature', 'Humidity', 'Conditions'], dtype='object')

In [57]:
df3.set_index("Day", inplace=True)
df3

            Temperature   Humidity Conditions
Day
2024-06-01    22.777346  77.935859     Cloudy
2024-06-02    22.582451  78.239990     Stormy
2024-06-03    26.680784  59.080233     Cloudy
2024-06-04    20.849121  61.596046     Stormy
2024-06-06    22.442286  52.210732      Sunny

In [58]:
df3.loc["2024-06-02"]

Temperature    22.582451
Humidity        78.23999
Conditions        Stormy
Name: 2024-06-02, dtype: object

In [59]:
df3.reset_index(inplace=True)
df3

          Day  Temperature   Humidity Conditions
0  2024-06-01    22.777346  77.935859     Cloudy
1  2024-06-02    22.582451  78.239990     Stormy
2  2024-06-03    26.680784  59.080233     Cloudy
3  2024-06-04    20.849121  61.596046     Stormy
4  2024-06-06    22.442286  52.210732      Sunny

In [60]:
df3.set_index("Conditions", inplace=True)
df3

                   Day  Temperature   Humidity
Conditions
Cloudy      2024-06-01    22.777346  77.935859
Stormy      2024-06-02    22.582451  78.239990
Cloudy      2024-06-03    26.680784  59.080233
Stormy      2024-06-04    20.849121  61.596046
Sunny       2024-06-06    22.442286  52.210732

In [61]:
df3.loc["Cloudy"]

                   Day  Temperature   Humidity
Conditions
Cloudy      2024-06-01    22.777346  77.935859
Cloudy      2024-06-03    26.680784  59.080233